FleetProbe/MicroBridge-Arduino-ATMega2560/hardware/microbridge/bootloaders/microbridge/stk500boot.c
/*****************************************************************************
 Title:     STK500v2 compatible bootloader
 Modified for Wiring board ATMega128-16MHz
 Author:    Peter Fleury <pfleury@gmx.ch>   http://jump.to/fleury
 File:      $Id: stk500boot.c,v 1.11 2006/06/25 12:39:17 peter Exp $
 Compiler:  avr-gcc 3.4.5 or 4.1 / avr-libc 1.4.3
 Hardware:  All AVRs with bootloader support, tested with ATmega8
 License:   GNU General Public License

 Modified:  Worapoht Kornkaewwattanakul <dev@avride.com>   http://www.avride.com
 Date:      17 October 2007
 Update:    1st, 29 Dec 2007 : Enable CMD_SPI_MULTI but ignore unused command by return 0x00 byte response..
 Compiler:  WINAVR20060421
 Description: add timeout feature like previous Wiring bootloader

 DESCRIPTION:
 This program allows an AVR with bootloader capabilities to
 read/write its own Flash/EEprom. To enter Programming mode
 an input pin is checked. If this pin is pulled low, programming mode
 is entered. If not, normal execution is done from $0000
 "reset" vector in Application area.
 Size fits into a 1024 word bootloader section
 when compiled with avr-gcc 4.1
 (direct replace on Wiring Board without fuse setting changed)

 USAGE:
 - Set AVR MCU type and clock-frequency (F_CPU) in the Makefile.
 - Set baud rate below (AVRISP only works with 115200 bps)
 - compile/link the bootloader with the supplied Makefile
 - program the "Boot Flash section size" (BOOTSZ fuses),
 for boot-size 1024 words:  program BOOTSZ01
 - enable the BOOT Reset Vector (program BOOTRST)
 - Upload the hex file to the AVR using any ISP programmer
 - Program Boot Lock Mode 3 (program BootLock 11 and BootLock 12 lock bits) // (leave them)
 - Reset your AVR while keeping PROG_PIN pulled low // (for enter bootloader by switch)
 - Start AVRISP Programmer (AVRStudio/Tools/Program AVR)
 - AVRISP will detect the bootloader
 - Program your application FLASH file and optional EEPROM file using AVRISP

 Note:
 Erasing the device without flashing, through AVRISP GUI button "Erase Device"
 is not implemented, due to AVRStudio limitations.
 Flash is always erased before programming.

 AVRdude:
 Please uncomment #define REMOVE_CMD_SPI_MULTI when using AVRdude.
 Comment #define REMOVE_PROGRAM_LOCK_BIT_SUPPORT to reduce code size
 Read Fuse Bits and Read/Write Lock Bits is not supported

 NOTES:
 Based on Atmel Application Note AVR109 - Self-programming
 Based on Atmel Application Note AVR068 - STK500v2 Protocol

 LICENSE:
 Copyright (C) 2006 Peter Fleury

 This program is free software; you can redistribute it and/or modify
 it under the terms of the GNU General Public License as published by
 the Free Software Foundation; either version 2 of the License, or
 any later version.

 This program is distributed in the hope that it will be useful,
 but WITHOUT ANY WARRANTY; without even the implied warranty of
 MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 GNU General Public License for more details.

 *****************************************************************************/

//************************************************************************
//*	Edit History
//************************************************************************
//*	Jul  7,	2010	<MLS> = Mark Sproul msproul@skycharoit.com
//*	Jul  7,	2010	<MLS> Working on mega2560. No Auto-restart
//*	Jul  7,	2010	<MLS> Switched to 8K bytes (4K words) so that we have room for the monitor
//*	Jul  8,	2010	<MLS> Found older version of source that had auto restart, put that code back in
//*	Jul  8,	2010	<MLS> Adding monitor code
//*	Jul 11,	2010	<MLS> Added blinking LED while waiting for download to start
//*	Jul 11,	2010	<MLS> Added EEPROM test
//*	Jul 29,	2010	<MLS> Added recchar_timeout for timing out on bootloading
//*	Aug 23,	2010	<MLS> Added support for atmega2561
//*	Aug 26,	2010	<MLS> Removed support for BOOT_BY_SWITCH
//*	Sep  8,	2010	<MLS> Added support for atmega16
//*	Nov  9,	2010	<MLS> Issue 392:Fixed bug that 3 !!! in code would cause it to jump to monitor
//*	Jun 24,	2011	<MLS> Removed analogRead (was not used)
//*	Dec 29,	2011	<MLS> Issue 181: added watch dog timmer support
//*	Dec 29,	2011	<MLS> Issue 505:  bootloader is comparing the seqNum to 1 or the current sequence 
//*	Jan  1,	2012	<MLS> Issue 543: CMD_CHIP_ERASE_ISP now returns STATUS_CMD_FAILED instead of STATUS_CMD_OK
//*	Jan  1,	2012	<MLS> Issue 543: Write EEPROM now does something (NOT TESTED)
//*	Jan  1,	2012	<MLS> Issue 544: stk500v2 bootloader doesn't support reading fuses
//************************************************************************
//************************************************************************
//*	these are used to test issues
//*	http://code.google.com/p/arduino/issues/detail?id=505
//*	Reported by mark.stubbs, Mar 14, 2011
//*	The STK500V2 bootloader is comparing the seqNum to 1 or the current sequence 
//*	(IE: Requiring the sequence to be 1 or match seqNum before continuing).  
//*	The correct behavior is for the STK500V2 to accept the PC's sequence number, and echo it back for the reply message.
#define	_FIX_ISSUE_505_
//************************************************************************
//*	Issue 181: added watch dog timmer support
#define	_FIX_ISSUE_181_

#include	<inttypes.h>
#include	<avr/io.h>
#include	<avr/interrupt.h>
#include	<avr/boot.h>
#include	<avr/pgmspace.h>
#include	<util/delay.h>
#include	<avr/eeprom.h>
#include	<avr/common.h>
#include	<stdlib.h>
#include	"command.h"

#include <string.h>
#include "pff.h"

void flash_erase(DWORD); /* Erase a flash page (asmfunc.S) */
void flash_write(DWORD, const BYTE*); /* Program a flash page (asmfunc.S) */

#define BLINK_LED_WHILE_WAITING
//#define _DEBUG_WITH_LEDS_
//#define _DEBUG_SERIAL_

#if defined(_MEGA_BOARD_) || defined(_BOARD_AMBER128_) || defined(__AVR_ATmega1280__) || defined(__AVR_ATmega2560__) \
	|| defined(__AVR_ATmega2561__) || defined(__AVR_ATmega1284P__) || defined(ENABLE_MONITOR)
#undef		ENABLE_MONITOR
#define		ENABLE_MONITOR
#endif

#ifndef EEWE
#define EEWE    1
#endif
#ifndef EEMWE
#define EEMWE   2
#endif

//#define	_DEBUG_SERIAL_
//#define	_DEBUG_WITH_LEDS_

