FleetProbe/MicroBridge-Arduino-ATMega2560/hardware/microbridge/bootloaders/microbridge/stk500boot.c
/*
 * Uncomment the following lines to save code space
 */
//#define	REMOVE_PROGRAM_LOCK_BIT_SUPPORT		// disable program lock bits
//#define	REMOVE_BOOTLOADER_LED				// no LED to show active bootloader
//#define	REMOVE_CMD_SPI_MULTI				// disable processing of SPI_MULTI commands, Remark this line for AVRDUDE <Worapoht>
//
//************************************************************************
//*	LED on pin "PROGLED_PIN" on port "PROGLED_PORT"
//*	indicates that bootloader is active
//*	PG2 -> LED on Wiring board
//************************************************************************
#define		BLINK_LED_WHILE_WAITING


#define SPI_DDRA DDRA
#define SPI_PORTA PORTA
#define SPI_DDRB DDRB
#define SPI_PORTB PORTB
#define SPI_DDRE DDRE
#define SPI_PORTE PORTE

#define SCK PINB1 //Pin 52
#define MISO PINB3 //Pin 50
#define MOSI PINB2 //Pin 51
#define SS PINE6 //Pin 22
#define SS_MASTER PINB0 //Pin 53
#define LED1 PINA0
#define LED2 PINA1
#define LED3 PINA2
		

#define LED1_LOW() SPI_PORTA &= ~(_BV(LED1))
#define LED1_HIGH() SPI_PORTA |= _BV(LED1)
#define LED2_LOW() SPI_PORTA &= ~(_BV(LED2))
#define LED2_HIGH() SPI_PORTA |= _BV(LED2)
#define LED3_LOW() SPI_PORTA &= ~(_BV(LED3))
#define LED3_HIGH() SPI_PORTA |= _BV(LED3)


#define SS_LOW() SPI_PORTE &= ~(_BV(SS))
#define SS_HIGH() SPI_PORTE |= _BV(SS)
#define SS_MASTER_LOW() SPI_PORTB &= ~_BV(SS_MASTER)
#define SS_MASTER_HIGH() SPI_PORTB |= _BV(SS_MASTER)

/*
 * define CPU frequency in Mhz here if not defined in Makefile
 */
#ifndef F_CPU
#define F_CPU 16000000UL
#endif

#define	_BLINK_LOOP_COUNT_	(F_CPU / 2250)
/*
 * UART Baudrate, AVRStudio AVRISP only accepts 115200 bps
 */

#ifndef BAUDRATE
#define BAUDRATE 115200
#endif

/*
 *  Enable (1) or disable (0) USART double speed operation
 */
#ifndef UART_BAUDRATE_DOUBLE_SPEED
#if defined (__AVR_ATmega32__)
#define UART_BAUDRATE_DOUBLE_SPEED 0
#else
#define UART_BAUDRATE_DOUBLE_SPEED 1
#endif
#endif

/*
 * HW and SW version, reported to AVRISP, must match version of AVRStudio
 */
#define CONFIG_PARAM_BUILD_NUMBER_LOW	0
#define CONFIG_PARAM_BUILD_NUMBER_HIGH	0
#define CONFIG_PARAM_HW_VER				0x0F
#define CONFIG_PARAM_SW_MAJOR			2
#define CONFIG_PARAM_SW_MINOR			0x0A

/*
 * Calculate the address where the bootloader starts from FLASHEND and BOOTSIZE
 * (adjust BOOTSIZE below and BOOTLOADER_ADDRESS in Makefile if you want to change the size of the bootloader)
 */
//#define BOOTSIZE 1024
#if FLASHEND > 0x0F000
#define BOOTSIZE 8192
#else
#define BOOTSIZE 2048
#endif

#define APP_END  (FLASHEND -(2*BOOTSIZE) + 1)

/*
 * Signature bytes are not available in avr-gcc io_xxx.h
 */
#if defined (__AVR_ATmega8__)
#define SIGNATURE_BYTES 0x1E9307
#elif defined (__AVR_ATmega16__)
#define SIGNATURE_BYTES 0x1E9403
#elif defined (__AVR_ATmega32__)
#define SIGNATURE_BYTES 0x1E9502
#elif defined (__AVR_ATmega8515__)
#define SIGNATURE_BYTES 0x1E9306
#elif defined (__AVR_ATmega8535__)
#define SIGNATURE_BYTES 0x1E9308
#elif defined (__AVR_ATmega162__)
#define SIGNATURE_BYTES 0x1E9404
#elif defined (__AVR_ATmega128__)
#define SIGNATURE_BYTES 0x1E9702
#elif defined (__AVR_ATmega1280__)
#define SIGNATURE_BYTES 0x1E9703
#elif defined (__AVR_ATmega2560__)
#define SIGNATURE_BYTES 0x1E9801
#elif defined (__AVR_ATmega2561__)
#define SIGNATURE_BYTES 0x1e9802
#elif defined (__AVR_ATmega1284P__)
#define SIGNATURE_BYTES 0x1e9705
#elif defined (__AVR_ATmega640__)
#define SIGNATURE_BYTES  0x1e9608
#elif defined (__AVR_ATmega64__)
#define SIGNATURE_BYTES  0x1E9602
#elif defined (__AVR_ATmega169__)
#define SIGNATURE_BYTES  0x1e9405
#elif defined (__AVR_AT90USB1287__)
#define SIGNATURE_BYTES  0x1e9782
#else
#error "no signature definition for MCU available"
#endif

#if defined(_BOARD_ROBOTX_) || defined(__AVR_AT90USB1287__) || defined(__AVR_AT90USB1286__)
#define	UART_BAUD_RATE_LOW			UBRR1L
#define	UART_STATUS_REG				UCSR1A
#define	UART_CONTROL_REG			UCSR1B
#define	UART_ENABLE_TRANSMITTER		TXEN1
#define	UART_ENABLE_RECEIVER		RXEN1
#define	UART_TRANSMIT_COMPLETE		TXC1
#define	UART_RECEIVE_COMPLETE		RXC1
#define	UART_DATA_REG				UDR1
#define	UART_DOUBLE_SPEED			U2X1

#elif defined(__AVR_ATmega8__) || defined(__AVR_ATmega16__) || defined(__AVR_ATmega32__) \
	|| defined(__AVR_ATmega8515__) || defined(__AVR_ATmega8535__)
/* ATMega8 with one USART */
#define	UART_BAUD_RATE_LOW			UBRRL
#define	UART_STATUS_REG				UCSRA
#define	UART_CONTROL_REG			UCSRB
#define	UART_ENABLE_TRANSMITTER		TXEN
#define	UART_ENABLE_RECEIVER		RXEN
#define	UART_TRANSMIT_COMPLETE		TXC
#define	UART_RECEIVE_COMPLETE		RXC
#define	UART_DATA_REG				UDR
#define	UART_DOUBLE_SPEED			U2X

#elif defined(__AVR_ATmega64__) || defined(__AVR_ATmega128__) || defined(__AVR_ATmega162__) \
	 || defined(__AVR_ATmega1280__) || defined(__AVR_ATmega2560__) || defined(__AVR_ATmega2561__)
/* ATMega with two USART, use UART0 */
#define	UART_BAUD_RATE_LOW			UBRR0L
#define	UART_STATUS_REG				UCSR0A
#define	UART_CONTROL_REG			UCSR0B
#define	UART_ENABLE_TRANSMITTER		TXEN0
#define	UART_ENABLE_RECEIVER		RXEN0
#define	UART_TRANSMIT_COMPLETE		TXC0
#define	UART_RECEIVE_COMPLETE		RXC0
#define	UART_DATA_REG				UDR0
#define	UART_DOUBLE_SPEED			U2X0
#elif defined(UBRR0L) && defined(UCSR0A) && defined(TXEN0)
/* ATMega with two USART, use UART0 */
#define	UART_BAUD_RATE_LOW			UBRR0L
#define	UART_STATUS_REG				UCSR0A
#define	UART_CONTROL_REG			UCSR0B
#define	UART_ENABLE_TRANSMITTER		TXEN0
#define	UART_ENABLE_RECEIVER		RXEN0
#define	UART_TRANSMIT_COMPLETE		TXC0
#define	UART_RECEIVE_COMPLETE		RXC0
#define	UART_DATA_REG				UDR0
#define	UART_DOUBLE_SPEED			U2X0
#elif defined(UBRRL) && defined(UCSRA) && defined(UCSRB) && defined(TXEN) && defined(RXEN)
//* catch all
#define	UART_BAUD_RATE_LOW			UBRRL
#define	UART_STATUS_REG				UCSRA
#define	UART_CONTROL_REG			UCSRB
#define	UART_ENABLE_TRANSMITTER		TXEN
#define	UART_ENABLE_RECEIVER		RXEN
#define	UART_TRANSMIT_COMPLETE		TXC
#define	UART_RECEIVE_COMPLETE		RXC
#define	UART_DATA_REG				UDR
#define	UART_DOUBLE_SPEED			U2X
#else
#error "no UART definition for MCU available"
#endif

#define SPI_MODE_MASK 0x0C  // CPOL = bit 3, CPHA = bit 2 on SPCR
#define SPI_CLOCK_MASK 0x03  // SPR1 = bit 1, SPR0 = bit 0 on SPCR
#define SPI_2XCLOCK_MASK 0x01  // SPI2X = bit 0 on SPSR

#define LSBFIRST 0
#define MSBFIRST 1
uint8_t transfer(uint8_t _data) {
	SPDR = _data;
	while (!(SPSR & _BV(SPIF)))
		;
	return SPDR;
}
void setDataMode(uint8_t mode) {
	SPCR = (SPCR & ~SPI_MODE_MASK) | mode;
}

void setBitOrder(uint8_t bitOrder) {
	if (bitOrder == LSBFIRST) {
		SPCR |= _BV(DORD);
	} else {
		SPCR &= ~(_BV(DORD));
	}
}

void setClockDivider(uint8_t rate) {
	SPCR = (SPCR & ~SPI_CLOCK_MASK) | (rate & SPI_CLOCK_MASK);
	SPSR = (SPSR & ~SPI_2XCLOCK_MASK) | ((rate >> 2) & SPI_2XCLOCK_MASK);
}

/// return the STATUS register
#define SPIFLASH_STATUSREAD       0x05
uint8_t readStatus() {
	SS_LOW();
	SS_MASTER_HIGH();
	transfer(SPIFLASH_STATUSREAD);
	uint8_t status = transfer(0);
	SS_HIGH();
	SS_MASTER_LOW();
	return status;
}
uint8_t busy() {
	return readStatus() & 1;
}

void command(uint8_t cmd) {

	while (busy())
		; //wait for any write/erase to complete
	SS_LOW();
	transfer(cmd);
}

#define SPIFLASH_ARRAYREADLOWFREQ 0x03
uint8_t spiReadReg(uint32_t address) {
	SS_LOW();
	command(SPIFLASH_ARRAYREADLOWFREQ);
	transfer(address >> 16);
	transfer(address >> 8);
	transfer(address);
	uint8_t result = transfer(0);
	SS_HIGH();
	return result;
}

