FleetProbe/MicroBridge-Arduino-ATMega2560/hardware/microbridge/bootloaders/microbridge/stk500boot.c
/*
 * Macro to calculate UBBR from XTAL and baudrate
 */
#if defined(__AVR_ATmega32__) && UART_BAUDRATE_DOUBLE_SPEED
#define UART_BAUD_SELECT(baudRate,xtalCpu) ((xtalCpu / 4 / baudRate - 1) / 2)
#elif defined(__AVR_ATmega32__)
#define UART_BAUD_SELECT(baudRate,xtalCpu) ((xtalCpu / 8 / baudRate - 1) / 2)
#elif UART_BAUDRATE_DOUBLE_SPEED
#define UART_BAUD_SELECT(baudRate,xtalCpu) (((float)(xtalCpu))/(((float)(baudRate))*8.0)-1.0+0.5)
#else
#define UART_BAUD_SELECT(baudRate,xtalCpu) (((float)(xtalCpu))/(((float)(baudRate))*16.0)-1.0+0.5)
#endif

/*
 * States used in the receive state machine
 */
#define	ST_START		0
#define	ST_GET_SEQ_NUM	1
#define ST_MSG_SIZE_1	2
#define ST_MSG_SIZE_2	3
#define ST_GET_TOKEN	4
#define ST_GET_DATA		5
#define	ST_GET_CHECK	6
#define	ST_PROCESS		7

/*
 * use 16bit address variable for ATmegas with <= 64K flash
 */
#if defined(RAMPZ)
typedef uint32_t address_t;
#else
typedef uint16_t address_t;
#endif

/*
 * function prototypes
 */
static void sendchar(char c);

// SDCARD BOOTLOADER

unsigned char Buff[SPM_PAGESIZE]; /* Page data buffer */

// SDCARD BOOTLOADER

/*
 * since this bootloader is not linked against the avr-gcc crt1 functions,
 * to reduce the code size, we need to provide our own initialization
 */
void __jumpMain(void) __attribute__ ((naked)) __attribute__ ((section (".init9")));
#include <avr/sfr_defs.h>

//#define	SPH_REG	0x3E
//#define	SPL_REG	0x3D

//*****************************************************************************
void __jumpMain(void) {
//*	July 17, 2010	<MLS> Added stack pointer initialzation
//*	the first line did not do the job on the ATmega128

	asm volatile ( ".set __stack, %0" :: "i" (RAMEND) );

//*	set stack pointer to top of RAM

	asm volatile ( "ldi	16, %0" :: "i" (RAMEND >> 8) );
	asm volatile ( "out %0,16" :: "i" (AVR_STACK_POINTER_HI_ADDR) );

	asm volatile ( "ldi	16, %0" :: "i" (RAMEND & 0x0ff) );
	asm volatile ( "out %0,16" :: "i" (AVR_STACK_POINTER_LO_ADDR) );

	asm volatile ( "clr __zero_reg__" );
	// GCC depends on register r1 set to 0
	asm volatile ( "out %0, __zero_reg__" :: "I" (_SFR_IO_ADDR(SREG)) );
	// set SREG to 0
	asm volatile ( "jmp main");
	// jump to main()
}

//*****************************************************************************
void delay_ms(unsigned int timedelay) {
	unsigned int i;
	for (i = 0; i < timedelay; i++) {
		_delay_ms(0.5);
	}
}

//*****************************************************************************
/*
 * send single byte to USART, wait until transmission is completed
 */
static void sendchar(char c) {
	UART_DATA_REG = c; // prepare transmission
	while (!(UART_STATUS_REG & (1 << UART_TRANSMIT_COMPLETE)))
		; // wait until byte sent
	UART_STATUS_REG |= (1 << UART_TRANSMIT_COMPLETE); // delete TXCflag
}

//************************************************************************
static int Serial_Available(void) {
	return (UART_STATUS_REG & (1 << UART_RECEIVE_COMPLETE)); // wait for data
}

#define	MAX_TIME_COUNT	(F_CPU >> 1)
//*****************************************************************************
static unsigned char recchar_timeout(void) {
	uint32_t count = 0;

	while (!(UART_STATUS_REG & (1 << UART_RECEIVE_COMPLETE))) {
		// wait for data
		count++;
		if (count > MAX_TIME_COUNT) {
			unsigned int data;
#if (FLASHEND > 0x10000)
			data = pgm_read_word_far(0); //*	get the first word of the user program
#else
			data = pgm_read_word_near(0); //*	get the first word of the user program
#endif
			if (data != 0xffff) //*	make sure its valid before jumping to it.
					{
				asm volatile(
						"clr	r30		\n\t"
						"clr	r31		\n\t"
						"ijmp	\n\t"
				);
			}
			count = 0;
		}
	}
	return UART_DATA_REG;
}


void dec_hex(long int num)   // Function Definition
{
long int rem[50],i=0,length=0;
if(num == 0){
	sendchar('0');
	sendchar('0');
}
while(num>0)
   {
      rem[i]=num%16;
      num=num/16;
      i++;
      length++;
   }

for(i=length-1;i>=0;i--)
  {
    switch(rem[i])
    {
    case 0:
        sendchar('0');
        break;
    case 1:
        sendchar('1');
        break;
    case 2:
        sendchar('2');
        break;
    case 3:
        sendchar('3');
        break;
    case 4:
        sendchar('4');
        break;
    case 5:
        sendchar('5');
        break;
    case 6:
        sendchar('6');
        break;
    case 7:
        sendchar('7');
        break;
    case 8:
        sendchar('8');
        break;
    case 9:
        sendchar('9');
        break;
      case 10:
          sendchar('A');
          break;
      case 11:
    	  sendchar('B');
          break;
      case 12:
    	  sendchar('C');
          break;
      case 13:
    	  sendchar('D');
          break;
      case 14:
    	  sendchar('E');
          break;
      case 15:
    	  sendchar('F');
          break;
      default :
         sendchar('X');
         break;
    }
  }
}


//*	for watch dog timer startup
void (*app_start)(void) = 0;
uint8_t check = 1;

//*****************************************************************************
int main(void) {

	setDataMode(0x00);
	setBitOrder(1);
	setClockDivider(0x04);
	SPI_PORTA = _BV(LED1) | _BV(LED2) | _BV(LED3);
	SPI_DDRA = _BV(LED1) | _BV(LED2) | _BV(LED3);
	SPI_PORTB = _BV(SCK) | _BV(MISO) | _BV(MOSI)  ;
	SPI_DDRB = _BV(SCK) | _BV(MOSI);
	SPI_PORTE = _BV(SS);
	SPI_DDRE = _BV(SS);

	LED1_LOW();
	LED2_LOW();
	LED3_LOW();
	
	SS_HIGH();
	SS_MASTER_HIGH();

	SPCR |= _BV(MSTR);
	SPCR |= _BV(SPE);

	address_t address = 0;
	address_t eraseAddress = 0;
	unsigned char msgParseState;
	unsigned int ii = 0;
	unsigned char checksum = 0;
	unsigned char seqNum = 0;
	unsigned int msgLength = 0;
	unsigned char msgBuffer[285];
	unsigned char c, *p;
	unsigned char isLeave = 0;

	unsigned long boot_timeout;
	unsigned long boot_timer;
	unsigned int boot_state;
#ifdef ENABLE_MONITOR
	unsigned int exPointCntr = 0;
	unsigned int rcvdCharCntr = 0;
#endif

	//*	some chips dont set the stack properly
	asm volatile ( ".set __stack, %0" :: "i" (RAMEND) );
	asm volatile ( "ldi	16, %0" :: "i" (RAMEND >> 8) );
	asm volatile ( "out %0,16" :: "i" (AVR_STACK_POINTER_HI_ADDR) );
	asm volatile ( "ldi	16, %0" :: "i" (RAMEND & 0x0ff) );
	asm volatile ( "out %0,16" :: "i" (AVR_STACK_POINTER_LO_ADDR) );

#ifdef _FIX_ISSUE_181_
	//************************************************************************
	//*	Dec 29,	2011	<MLS> Issue #181, added watch dog timmer support
	//*	handle the watch dog timer
	uint8_t mcuStatusReg;
	mcuStatusReg = MCUSR;

	__asm__ __volatile__ ("cli");
	__asm__ __volatile__ ("wdr");
	MCUSR = 0;
	WDTCSR |= _BV(WDCE) | _BV(WDE);
	WDTCSR = 0;
	__asm__ __volatile__ ("sei");

	// check if WDT generated the reset, if so, go straight to app
	if (mcuStatusReg & _BV(WDRF)) {
		app_start();
	}
	//************************************************************************
#endif

