FleetProbe/MicroBridge-Arduino-ATMega2560/hardware/microbridge/bootloaders/microbridge/stk500boot.c
	boot_timer = 0;
	boot_state = 0;

#ifdef BLINK_LED_WHILE_WAITING
//	boot_timeout	=	 90000;		//*	should be about 4 seconds
//	boot_timeout	=	170000;
	boot_timeout = 100000; //*	should be about 1 second
#else
			boot_timeout = 3500000; // 7 seconds , approx 2us per step when optimize "s"
#endif
	/*
	 * Branch to bootloader or application code ?
	 */

#ifndef REMOVE_BOOTLOADER_LED
	/* PROG_PIN pulled low, indicate with LED that bootloader is active */
			//PROGLED_DDR |= (1 << PROGLED_PIN);
//	PROGLED_PORT	&=	~(1<<PROGLED_PIN);	// active low LED ON
//	PROGLED_PORT |= (1 << PROGLED_PIN); // active high LED ON

#ifdef _DEBUG_WITH_LEDS_
//	for (ii=0; ii<3; ii++)
//	{
//		PROGLED_PORT &= ~(1<<PROGLED_PIN); // turn LED off
//		delay_ms(100);
//		PROGLED_PORT |= (1<<PROGLED_PIN);// turn LED on
//		delay_ms(100);
//	}
#endif

#endif

	/*
	 * Init UART
	 * set baudrate and enable USART receiver and transmiter without interrupts
	 */
#if UART_BAUDRATE_DOUBLE_SPEED
	UART_STATUS_REG |= (1 << UART_DOUBLE_SPEED);
#endif
	UART_BAUD_RATE_LOW = UART_BAUD_SELECT(BAUDRATE,F_CPU);
	UART_CONTROL_REG = (1 << UART_ENABLE_RECEIVER) | (1 << UART_ENABLE_TRANSMITTER);

	asm volatile ("nop");
	// wait until port has changed

//	sendchar('b');
//    sendchar('o');
//    sendchar('o');
//    sendchar('t');
//    sendchar('i');
//    sendchar('n');
//    sendchar('g');
//    sendchar('.');
//    sendchar('.');
//    sendchar('.');
//    sendchar(0x0d);
//    sendchar(0x0a);
//    delay_ms(100);

	while (boot_state == 0) {
		while ((!(Serial_Available())) && (boot_state == 0)) // wait for data
		{
			_delay_ms(0.001);
			boot_timer++;
			if (boot_timer > boot_timeout) {
				boot_state = 1; // (after ++ -> boot_state=2 bootloader timeout, jump to main 0x00000 )
			}
#ifdef BLINK_LED_WHILE_WAITING
			if ((boot_timer % _BLINK_LOOP_COUNT_) == 0) {
				//*	toggle the LED
				//PROGLED_PORT ^= (1 << PROGLED_PIN); // turn LED ON
			}
#endif
		}
		/* PROG_PIN pulled low, indicate with LED that bootloader is active */
		//	PROGLED_PORT	&=	~(1<<PROGLED_PIN);	// active low LED ON
		// SDCARD BOOTLOADER
		boot_state++; // ( if boot_state=1 bootloader received byte from UART, enter bootloader mode)
	}

	if (boot_state == 1) {
		//*	main loop
		while (!isLeave) {
			/*
			 * Collect received bytes to a complete message
			 */
			msgParseState = ST_START;
			while (msgParseState != ST_PROCESS) {
				if (boot_state == 1) {
					boot_state = 0;
					c = UART_DATA_REG;
				} else {
					//	c	=	recchar();
					c = recchar_timeout();

				}

#ifdef ENABLE_MONITOR
				rcvdCharCntr++;

				if ((c == '!') && (rcvdCharCntr < 10))
				{
					exPointCntr++;
					if (exPointCntr == 3)
					{
						exPointCntr = 0; //	reset back to zero so we dont get in an endless loop
						isLeave = 1;
						msgParseState = 99;//*	we dont want it do anything
						break;
					}
				}
				else
				{
					exPointCntr = 0;
				}
#endif

				switch (msgParseState) {
				case ST_START:
					if (c == MESSAGE_START) {
						msgParseState = ST_GET_SEQ_NUM;
						checksum = MESSAGE_START ^ 0;
					}
					break;

				case ST_GET_SEQ_NUM:
#ifdef _FIX_ISSUE_505_
					seqNum = c;
					msgParseState = ST_MSG_SIZE_1;
					checksum ^= c;
#else
					if ( (c == 1) || (c == seqNum) )
					{
						seqNum = c;
						msgParseState = ST_MSG_SIZE_1;
						checksum ^= c;
					}
					else
					{
						msgParseState = ST_START;
					}
#endif
					break;

				case ST_MSG_SIZE_1:
					msgLength = c << 8;
					msgParseState = ST_MSG_SIZE_2;
					checksum ^= c;
					break;

				case ST_MSG_SIZE_2:
					msgLength |= c;
					msgParseState = ST_GET_TOKEN;
					checksum ^= c;
					break;

				case ST_GET_TOKEN:
					if (c == TOKEN) {
						msgParseState = ST_GET_DATA;
						checksum ^= c;
						ii = 0;
					} else {
						msgParseState = ST_START;
					}
					break;

				case ST_GET_DATA:
					msgBuffer[ii++] = c;
					checksum ^= c;
					if (ii == msgLength) {
						msgParseState = ST_GET_CHECK;
					}
					break;

				case ST_GET_CHECK:
					if (c == checksum) {
						msgParseState = ST_PROCESS;
					} else {
						msgParseState = ST_START;
					}
					break;
				} //	switch
			} //	while(msgParseState)

			/*
			 * Now process the STK500 commands, see Atmel Appnote AVR068
			 */

			switch (msgBuffer[0]) {
#ifndef REMOVE_CMD_SPI_MULTI
			case CMD_SPI_MULTI: {
				unsigned char answerByte;
				unsigned char flag = 0;

				if (msgBuffer[4] == 0x30) {
					unsigned char signatureIndex = msgBuffer[6];

					if (signatureIndex == 0) {
						answerByte = (SIGNATURE_BYTES >> 16) & 0x000000FF;
					} else if (signatureIndex == 1) {
						answerByte = (SIGNATURE_BYTES >> 8) & 0x000000FF;
					} else {
						answerByte = SIGNATURE_BYTES & 0x000000FF;
					}
				} else if (msgBuffer[4] & 0x50) {
					//*	Issue 544: 	stk500v2 bootloader doesn't support reading fuses
					//*	I cant find the docs that say what these are supposed to be but this was figured out by trial and error
					//	answerByte	=	boot_lock_fuse_bits_get(GET_LOW_FUSE_BITS);
					//	answerByte	=	boot_lock_fuse_bits_get(GET_HIGH_FUSE_BITS);
					//	answerByte	=	boot_lock_fuse_bits_get(GET_EXTENDED_FUSE_BITS);
					if (msgBuffer[4] == 0x50) {
						answerByte = boot_lock_fuse_bits_get(GET_LOW_FUSE_BITS);
					} else if (msgBuffer[4] == 0x58) {
						answerByte = boot_lock_fuse_bits_get(GET_HIGH_FUSE_BITS);
					} else {
						answerByte = 0;
					}
				} else {
					answerByte = 0; // for all others command are not implemented, return dummy value for AVRDUDE happy <Worapoht>
				}
				if (!flag) {
					msgLength = 7;
					msgBuffer[1] = STATUS_CMD_OK;
					msgBuffer[2] = 0;
					msgBuffer[3] = msgBuffer[4];
					msgBuffer[4] = 0;
					msgBuffer[5] = answerByte;
					msgBuffer[6] = STATUS_CMD_OK;
				}
			}
				break;
#endif
			case CMD_SIGN_ON:
				msgLength = 11;
				msgBuffer[1] = STATUS_CMD_OK;
				msgBuffer[2] = 8;
				msgBuffer[3] = 'A';
				msgBuffer[4] = 'V';
				msgBuffer[5] = 'R';
				msgBuffer[6] = 'I';
				msgBuffer[7] = 'S';
				msgBuffer[8] = 'P';
				msgBuffer[9] = '_';
				msgBuffer[10] = '2';
				break;

			case CMD_GET_PARAMETER: {
				unsigned char value;

