FleetProbe/MicroBridge-Arduino-ATMega2560/hardware/microbridge/bootloaders/microbridge/stk500boot.c
				switch (msgBuffer[1]) {
				case PARAM_BUILD_NUMBER_LOW:
					value = CONFIG_PARAM_BUILD_NUMBER_LOW;
					break;
				case PARAM_BUILD_NUMBER_HIGH:
					value = CONFIG_PARAM_BUILD_NUMBER_HIGH;
					break;
				case PARAM_HW_VER:
					value = CONFIG_PARAM_HW_VER;
					break;
				case PARAM_SW_MAJOR:
					value = CONFIG_PARAM_SW_MAJOR;
					break;
				case PARAM_SW_MINOR:
					value = CONFIG_PARAM_SW_MINOR;
					break;
				default:
					value = 0;
					break;
				}
				msgLength = 3;
				msgBuffer[1] = STATUS_CMD_OK;
				msgBuffer[2] = value;
			}
				break;

			case CMD_LEAVE_PROGMODE_ISP:
				isLeave = 1;
				//*	fall thru

			case CMD_SET_PARAMETER:
			case CMD_ENTER_PROGMODE_ISP:
				msgLength = 2;
				msgBuffer[1] = STATUS_CMD_OK;
				break;

			case CMD_READ_SIGNATURE_ISP: {
				unsigned char signatureIndex = msgBuffer[4];
				unsigned char signature;

				if (signatureIndex == 0)
					signature = (SIGNATURE_BYTES >> 16) & 0x000000FF;
				else if (signatureIndex == 1)
					signature = (SIGNATURE_BYTES >> 8) & 0x000000FF;
				else
					signature = SIGNATURE_BYTES & 0x000000FF;

				msgLength = 4;
				msgBuffer[1] = STATUS_CMD_OK;
				msgBuffer[2] = signature;
				msgBuffer[3] = STATUS_CMD_OK;
			}
				break;

			case CMD_READ_LOCK_ISP:
				msgLength = 4;
				msgBuffer[1] = STATUS_CMD_OK;
				msgBuffer[2] = boot_lock_fuse_bits_get( GET_LOCK_BITS );
				msgBuffer[3] = STATUS_CMD_OK;
				break;

			case CMD_READ_FUSE_ISP: {
				unsigned char fuseBits;

				if (msgBuffer[2] == 0x50) {
					if (msgBuffer[3] == 0x08)
						fuseBits = boot_lock_fuse_bits_get( GET_EXTENDED_FUSE_BITS );
					else
						fuseBits = boot_lock_fuse_bits_get( GET_LOW_FUSE_BITS );
				} else {
					fuseBits = boot_lock_fuse_bits_get( GET_HIGH_FUSE_BITS );
				}
				msgLength = 4;
				msgBuffer[1] = STATUS_CMD_OK;
				msgBuffer[2] = fuseBits;
				msgBuffer[3] = STATUS_CMD_OK;
			}
				break;

#ifndef REMOVE_PROGRAM_LOCK_BIT_SUPPORT
			case CMD_PROGRAM_LOCK_ISP: {
				unsigned char lockBits = msgBuffer[4];

				lockBits = (~lockBits) & 0x3C; // mask BLBxx bits
				boot_lock_bits_set(lockBits);
				// and program it
				boot_spm_busy_wait();

				msgLength = 3;
				msgBuffer[1] = STATUS_CMD_OK;
				msgBuffer[2] = STATUS_CMD_OK;
			}
				break;
#endif
			case CMD_CHIP_ERASE_ISP:
				eraseAddress = 0;
				msgLength = 2;
				//	msgBuffer[1]	=	STATUS_CMD_OK;
				msgBuffer[1] = STATUS_CMD_FAILED; //*	isue 543, return FAILED instead of OK
				break;

			case CMD_LOAD_ADDRESS:
#if defined(RAMPZ)
				address = ( ((address_t)(msgBuffer[1])<<24)|((address_t)(msgBuffer[2])<<16)|((address_t)(msgBuffer[3])<<8)|(msgBuffer[4]) )<<1;
#else
				address = (((msgBuffer[3]) << 8) | (msgBuffer[4])) << 1; //convert word to byte address
#endif
				msgLength = 2;
				msgBuffer[1] = STATUS_CMD_OK;
				break;

			case CMD_PROGRAM_FLASH_ISP:
			case CMD_PROGRAM_EEPROM_ISP: {
				unsigned int size = ((msgBuffer[1]) << 8) | msgBuffer[2];
				unsigned char *p = msgBuffer + 10;
				unsigned int data;
				unsigned char highByte, lowByte;
				address_t tempaddress = address;

				if (msgBuffer[0] == CMD_PROGRAM_FLASH_ISP) {
					// erase only main section (bootloader protection)
					if (eraseAddress < APP_END) {
						boot_page_erase(eraseAddress);
						// Perform page erase
						boot_spm_busy_wait(); // Wait until the memory is erased.
						eraseAddress += SPM_PAGESIZE; // point to next page to be erase
					}

					/* Write FLASH */
					do {
						lowByte = *p++;
						highByte = *p++;

						data = (highByte << 8) | lowByte;
						boot_page_fill(address, data);

						address = address + 2; // Select next word in memory
						size -= 2; // Reduce number of bytes to write by two
					} while (size); // Loop until all bytes written

					boot_page_write(tempaddress);
					boot_spm_busy_wait();
					boot_rww_enable(); // Re-enable the RWW section
				} else {
					//*	issue 543, this should work, It has not been tested.
					uint16_t ii = address >> 1;
					/* write EEPROM */
					while (size) {
						eeprom_write_byte((uint8_t*) ii, *p++);
						address += 2; // Select next EEPROM byte
						ii++;
						size--;
					}
				}
				msgLength = 2;
				msgBuffer[1] = STATUS_CMD_OK;
			}
				break;

			case CMD_READ_FLASH_ISP:
			case CMD_READ_EEPROM_ISP: {
				unsigned int size = ((msgBuffer[1]) << 8) | msgBuffer[2];
				unsigned char *p = msgBuffer + 1;
				msgLength = size + 3;

				*p++ = STATUS_CMD_OK;
				if (msgBuffer[0] == CMD_READ_FLASH_ISP) {
					unsigned int data;

					// Read FLASH
					do {
						//#if defined(RAMPZ)
#if (FLASHEND > 0x10000)
						data = pgm_read_word_far(address);
#else
						data = pgm_read_word_near(address);
#endif
						*p++ = (unsigned char) data; //LSB
						*p++ = (unsigned char) (data >> 8); //MSB
						address += 2; // Select next word in memory
						size -= 2;
					} while (size);
				} else {
					/* Read EEPROM */
					do {
						EEARL = address; // Setup EEPROM address
						EEARH = ((address >> 8));
						address++; // Select next EEPROM byte
						EECR |= (1 << EERE); // Read EEPROM
						*p++ = EEDR; // Send EEPROM data
						size--;
					} while (size);
				}
				*p++ = STATUS_CMD_OK;
			}
				break;

			default:
				msgLength = 2;
				msgBuffer[1] = STATUS_CMD_FAILED;
				break;
			}

			/*
			 * Now send answer message back
			 */
			sendchar(MESSAGE_START);
			checksum = MESSAGE_START ^ 0;

			sendchar(seqNum);
			checksum ^= seqNum;

			c = ((msgLength >> 8) & 0xFF);
			sendchar(c);
			checksum ^= c;

			c = msgLength & 0x00FF;
			sendchar(c);
			checksum ^= c;

			sendchar(TOKEN);
			checksum ^= TOKEN;

			p = msgBuffer;
			while (msgLength) {
				c = *p++;
				sendchar(c);
				checksum ^= c;
				msgLength--;
			}
			sendchar(checksum);
			seqNum++;

#ifndef REMOVE_BOOTLOADER_LED
			//*	<MLS>	toggle the LED
		//	PROGLED_PORT ^= (1 << PROGLED_PIN); // active high LED ON
#endif

		}
	}

	if (boot_state == 2) {
		if (eeprom_read_byte(4095) == 0xF0) {
			sendchar('u');
			sendchar('p');
			sendchar('g');
			sendchar('r');
			sendchar('a');
			sendchar('d');
			sendchar('i');
			sendchar('n');
			sendchar('g');
			sendchar(0x0d);
			sendchar(0x0a);
			delay_ms(100);

