FleetProbe/MicroBridge-Arduino-ATMega2560/hardware/microbridge/bootloaders/microbridge/stk500boot.c
			DWORD fa; /* Flash address */
			sendchar(0x0d);
			sendchar(0x0a);
			long address = 16;
			for (fa = 0; fa < 0x3E000; fa += SPM_PAGESIZE) { /* Update all application pages */
		//		PROGLED_PORT ^= (1 << PROGLED_PIN); // turn LED ON
				delay_ms(50);
				flash_erase(fa); /* Erase a page */
				memset(Buff, 0xFF, SPM_PAGESIZE); /* Clear buffer */
				for (int i = 0; i < SPM_PAGESIZE; i++) {
					Buff[i] = spiReadReg(address);
					address++;
					// sendchar('[');
					// dec_hex(Buff[i]);
					// sendchar(']');
					// if(address % 16 == 0 && address != 0){
					// 	sendchar(0x0d);
					// 	sendchar(0x0a);
					// }
					// 
					// 
					if(((address +1)%1200) <= 300 && ((address +1)%1200) >= 0){
						LED1_HIGH();
						LED2_LOW();
						LED3_LOW();
					}else if(((address +1)%1200) <= 700 && ((address +1)%1200) >= 400){
						LED1_LOW();
						LED2_HIGH();
						LED3_LOW();
					}else if( ((address +1) %1200) <= 1100  && ((address +1) %1200) >= 8){
						LED1_LOW();
						LED2_LOW();
						LED3_HIGH();
					}
				}
				flash_write(fa, Buff); /* Write it if the data is available */
			}
			sendchar('d');
			sendchar(0x0d);
			sendchar(0x0a);
			check = 0;
			eeprom_write_byte(4095, 0x00);
		}

		boot_state = 0;
	}

	asm volatile ("nop");
	// wait until port has changed

//    // SDCARD BOOTLOADER
//
//    WORD fa;	/* Flash address */
//    WORD br;	/* Bytes read */
//	uint8_t i = 0;
//
//
//	pf_mount(&Fatfs);	/* Initialize file system */
//
//
//	if (pf_open("app.bin") == FR_OK) {	/* Open application file */
//        PROGLED_PORT	|=	(1<<PROGLED_PIN);	// turn LED on
//		
//        for (fa = 0; fa < 0x1000; fa += SPM_PAGESIZE) {	/* Update all application pages */
//            memset(Buff, 0xFF, SPM_PAGESIZE);		/* Clear buffer */
//            pf_read(Buff, SPM_PAGESIZE, &br);		/* Load a page data */
//            
//			if (br) {					/* Bytes Read > 0? */
//            	for (i = br; i < SPM_PAGESIZE; i++)     /* Pad the remaining last page with 0xFF so that comparison goes OK */
//                    Buff[i] = 0xFF;
//                if (pagecmp(fa, Buff)) {
//                    flash_erase(fa);		/* Erase a page */
//                    flash_write(fa, Buff);		/* Write it if the data is available */
//                }
//            }
//    	}
//        PROGLED_PORT	&=	~(1<<PROGLED_PIN);	// turn LED off
//        
//    }
//    
//    if (pgm_read_word(0) != 0xFFFF)		/* Start application if exist */
//        asm volatile("jmp 0000");
//    // SD CARD BOOTLOADER

	/*
	 * Now leave bootloader
	 */

	UART_STATUS_REG &= 0xfd;
	boot_rww_enable(); // enable application section

	asm volatile(
			"clr	r30		\n\t"
			"clr	r31		\n\t"
			"ijmp	\n\t"
	);
//	asm volatile ( "push r1" "\n\t"		// Jump to Reset vector in Application Section
//					"push r1" "\n\t"
//					"ret"	 "\n\t"
//					::);

	/*
	 * Never return to stop GCC to generate exit return code
	 * Actually we will never reach this point, but the compiler doesn't
	 * understand this
	 */
	for (;;)
		;
}

/*
 base address = f800

 avrdude: Device signature = 0x1e9703
 avrdude: safemode: lfuse reads as FF
 avrdude: safemode: hfuse reads as DA
 avrdude: safemode: efuse reads as F5
 avrdude>


 base address = f000
 avrdude: Device signature = 0x1e9703
 avrdude: safemode: lfuse reads as FF
 avrdude: safemode: hfuse reads as D8
 avrdude: safemode: efuse reads as F5
 avrdude>
 */

//************************************************************************
#ifdef ENABLE_MONITOR
#include	<math.h>

unsigned long gRamIndex;
unsigned long gFlashIndex;
unsigned long gEepromIndex;

#define	true	1
#define	false	0

#include	"avr_cpunames.h"

#ifndef _AVR_CPU_NAME_
#error cpu name not defined
#endif

#ifdef _VECTORS_SIZE
#define	kInterruptVectorCount (_VECTORS_SIZE / 4)
#else
#define	kInterruptVectorCount 23
#endif

void PrintDecInt(int theNumber, int digitCnt);

#ifdef _AVR_CPU_NAME_
const char gTextMsg_CPU_Name[] PROGMEM = _AVR_CPU_NAME_;
#else
const char gTextMsg_CPU_Name[] PROGMEM = "UNKNOWN";
#endif

//************************************************************************
void PrintFromPROGMEM(const void *dataPtr, unsigned char offset)
{
	char theChar;

	dataPtr += offset;

	do {
#if (FLASHEND > 0x10000)
		theChar = pgm_read_byte_far((uint16_t)dataPtr++);
#else
		theChar = pgm_read_byte_near((uint16_t)dataPtr++);
#endif
		if (theChar != 0)
		{
			sendchar(theChar);
		}
	}while (theChar != 0);
}

//************************************************************************
void PrintNewLine(void)
{
	sendchar(0x0d);
	sendchar(0x0a);
}

//************************************************************************
void PrintFromPROGMEMln(const void *dataPtr, unsigned char offset)
{
	PrintFromPROGMEM(dataPtr, offset);

	PrintNewLine();
}

//************************************************************************
void PrintString(char *textString)
{
	char theChar;
	int ii;

	theChar = 1;
	ii = 0;
	while (theChar != 0)
	{
		theChar = textString[ii];
		if (theChar != 0)
		{
			sendchar(theChar);
		}
		ii++;
	}
}

//************************************************************************
void PrintHexByte(unsigned char theByte)
{
	char theChar;

	theChar = 0x30 + ((theByte >> 4) & 0x0f);
	if (theChar > 0x39)
	{
		theChar += 7;
	}
	sendchar(theChar );

	theChar = 0x30 + (theByte & 0x0f);
	if (theChar > 0x39)
	{
		theChar += 7;
	}
	sendchar(theChar );
}

//************************************************************************
void PrintDecInt(int theNumber, int digitCnt)
{
	int theChar;
	int myNumber;

	myNumber = theNumber;

	if ((myNumber > 100) || (digitCnt >= 3))
	{
		theChar = 0x30 + myNumber / 100;
		sendchar(theChar );
	}

	if ((myNumber > 10) || (digitCnt >= 2))
	{
		theChar = 0x30 + ((myNumber % 100) / 10 );
		sendchar(theChar );
	}
	theChar = 0x30 + (myNumber % 10);
	sendchar(theChar );
}

#endif
